{"offChallenge":{
  "day1":{
    "title":"My best and first work day",
    "text":"قررت في الليلة التي تسبق هذا اليوم تغيير نظام حياتي و الإستيقاظ باكرا، و حددت الخامسة صباحا الذي يطابق موعد آذان الصبح حسب ما أخبرتني به أمي. في تمام الساعة الخامسة رن الهاتف ولم أستطع استيعاب أن وقت النهوض قد حان حيث أنني تأخرت في النوم البارحة لذالك واجهت صعوبة كبيرة في الإستيقاظ لكن وبفضل الله تمكنت من تحمل التعب ونهظت متمايلا واتجهت إلى المنزل السفلي القديم حيث توجد أمي وجدتي لاحظت بالنظر إلى نافذة المطبخ أن أمي لم تنزل بعد فجلست في الخارج تحديدا في ما نسميه بالأمازيغية بال'حوش' وذالك لأنني لا أمللك مفتاح الباب.بعد بضع دقائق شغلت أضواء المطبخ و السلالم إنها أمي استيقظت أخيرا،كنت محتارا كيف أناديها لتفتح لي الباب خوفا من أن أصيبها بالفزع وناديت في النافذة و رددت 'تشش تشش تشش' وفعلا حدث ما كنت خائفا منه وفزعت أمي.فتحت لي الباب فأخذت الماء و خرجت مرة اخرى للوضوء،ثم صليت صلاة الفجر و من بعدها صلاة الصبح بنصيحة من أمي.رجعت إلى البيت العلوي في انظار تحضير أمي للحساء ولبست 'الفوقياء' ثم خرجت مع بداية بزوغ ضوء النهار وحاولت تصوير الشروق بوضع هاتفي فوق لبنة أمام الباب الخارجي للمنزل ثم بدأت تصوير الفيديو وتركت الهاتف و ذهبت للتنزه حول المنزل تحديدا في 'إغيران' و جلست فوق صخرة ورياح الصباح الباردة تلسع وجهي وزقزقة العصافير تطرب أذني.بعد مدة رجعت إلى المنزل ووجدت الحساء جاهزا فسكبته في اناء وحضرت بعض التمر وجلست تحت الضواية تحديدا في 'تبلاط' وشربت الحساء ثم ارتئيت تفقد هاتفي فوجت التسجيل قد توقف بفعل امتلاء مساحة التخزين فأخذته و كانت مدته ثلاثون دقيقة و توجهت نحو المنزل العلوي ودخلت الى غرفة نومي و شغلت الحاسوب ثم قمت ببعض التمارين الرياضية الخفيفة لتبعث في جسمي بعض النشاط ثم منتجت الفيديو ليتحول من ثلاثون دقيقة الى ثلاثون ثانية اتمنى ان لا يضيع واحتفض به دائما.بعدها بدأت في قرائة كتاب 'رحلة الدجال الناعمة' بعد بضع صفحات غفوت قليلا لكن نهضت بعدها بسرعة وشربت القليل من الماء ثم شغلت الفيديو الأول من سلسلة 'elzero' لتحويل تصميم الى كود انهيت الفديو  عند حوالي التاسعة صباحا وتوجهت الى المنزل السفلي مجددا لتناول الفطور . بعد تناول الوجبة رجعت الى البيت العلوي وبدأت فعليا في كتابة الأكواد اتباعا لتعليمات أسامة الزيرو في سلسلته. انهمكت فيها حتى الواحدة ظهرا و نزلت لتناول الغذاء . حيث طبخت امي السمك في الطاجين تناولناه أنا و مصطفى و جدتي ثم صليت الظهر وعدت الى المنزل العلوي للنوم قليلا وفعلا غفوت حتى الخامسة بعد الظهر و نهظت ثم نزلت مرة اخرى و توضأت وصليت العصر و تناولنا وجبة أخرى حيث تناول مصطفى و جدتي الحساء الباقي من يوم البارحة بينما اكتفيت بالخبز و زيت الزيتون مع الشاي.بعدها قصدت البئر لجلب الماء تلبية لطلب امي ثم دخلت مرة اخرى الى البيت و قصدت غرفة التلفاز و لبثت احاول ايجاد قناة تنقل نهائي دوري أبطال أوروبا بين مانشستر سيتي و انتر ميلان لكن دون جدوى حتى أن الأنترنت نفذ ايضا بعد ان يأست من ايجدها نزلت وتوضأت و ذهبت للمسجد لأصلي صلاة المغرب .وبعد الصلاة و تلاوة القرآن تحديدا الحزب العاشر وجه الإمام كعادته عدة أسئلة لنا تخص الأفعال في بداية الحزب و يسألنا عن الفعل و مضارعه و ماضيه و اسم الفاعل والمفعول ومختلف الأسئلة الاخرى. بعدها انصرفنا نحو المنزل ثم جلسننا ننتظر وصول أبي لأنه يوم السبت وفعلا أتى هو و عمي محمد و تناولنا العشاء و جلسنا نتحدث عن تطور اشغال البناء لبيتين كنا نبنيهما في تزنيت بمنطقة 'بوتييني' و أثناء استعدادنا للإنصراف و الذهاب للنوم دخل خاليد و اخوه محمد وتوجهنا جميعا أنا و مصطفى و محمد و اخوه خاليد نحو البيت العلوي للنوم و ها أنا الآن أكتب يوميات هذا اليوم التي أسرفت في شرح تفاصيلها و أتمنى أن استمر في هذه العادة المفيدة انشاء الله",
    "image":"20230610_064421.jpg",
    "date":"10/06/2023"
  },
  "day2": {
    "title": "Now time for discipline",
    "text": "لا أستطيع الكتابة كثيرا حقا لكنني لم أقضي أفضل يوم أو لنقل اليوم الذي كنت أخطط له فلم أصلي صلاة المغرب في المسجد و لم أقرأ أية صفحة من كتاب 'رحلة الدجال الناعمة' و بعد وصولي لأنزي بغية اصلاح بطارية الحاسوب لم استفد كثيرا من قصة يوسف عليه السلام وأرجو أن ألتزم بطريق الحق والطريق المستقيم و لا ألتفت إلى الوسواس الذي تبثه النفس في ذهني",
    "image": "",
    "date": "11/06/2023"
  },
  "day3": {
    "title": "A bad day but i am not going to giveup",
    "text": "يوم سيء جدا حتى أسوء من الذي قبله لم أستيقظ لصلاة الصبح ولم أصلي المغرب في المسجد و تراكمت علي الصلوات وكذالك لم أصلح بطارية الحاسوب و لم أرجع إلى القرية. بل أمضيت كامل اليوم الذي بدأ من الحادية عشر صباحا أي وقت جد متأخر خلف الشاشة أحاول تشغيل فورفي 49 درهم لكن في الأخير فشلت و أدخلت 50 درهم لخدمة smart solde بدون فائدة أتمنى أن أستيقظ و أركز أكثر في اليوم التالي فأنا في انحدار مستمر آمل أن يتوقف قريبا و هذا لا يعني الإنتظار و الترقب لحدوث هذا كأنني لا أملك أي سلطة أو قرار في ما يجري بل أنا السبب و المذنب الأول في هذا الشأن و إنشاء الله الغد سيكون أفضل",
    "image": "",
    "date": "12/06/2023"
  },
  "day4": {
    "title": "a terabl day I really need a quick reaction",
    "text": "يوم آخر أسوء من الذي قبله و الذي قبله أيضا ليس أنني لم أحقق أهداف اليوم بل أنني لم أضع أية أهداف في الأساس و هذا يعد فشلا كبيرا و خطوة كبيرة للوراء. الشيء الوحيد الذي يمننا القول عنه منتج أو مفيد هو أنني أزلت بطارية الحاسوب أخيرا بنفسي بعد أن وجدت 'omar' مغلقا، بعد أن عدت إلى القرية وإلى بيئتي المعتادة سأقلب الأمور غدا إنشاء الله و سأحاول أن أجعله يوما مثمرا جدا و سؤوقف هذا الإنحدار الشديد و أبتعد عن هذا الطريق الذي يدفعني إليه الهوى و انفس لأنني قد جربته سلفا و أعرف آخره و لا أريد تكرار هذا مجددا",
    "image": "Screenshot_20230614-010009-1.jpg",
    "date": "13/06/2023"
  },
  "day5": {
    "title": "Things didn't go well",
    "text": "الوقت تأخر جدا ولا أستطيع الكتابة كثيرا لكن عموما لم أنجز أي هدف من أهداف اليوم وهذا يعني أنني فشلت تماما في قلب الأوضاع و إعادة السيطرة و النظام لحياتي و لست متفائلا كثيرا بخصوص الغد لأنني غالبا سأمضيه كاملا في تيغمي بطلب من خاليد لتغشيش صديقته في امتحان الثالثة اعدادي أنا طبعا لا أوافق على هاذا الفعل و لكن ما باليد حيلة عجزت عن قول لا له لأنه ساعدني أيضا في العديد من الأمور قبلها. و لا أنسى أيضا ذكر خبر مهم و هو إكمالي لعامي السابع عشر و هو عمر كبير و ملزم يصبح فيه الفرد مكلفا و يجب عليه الإعتماد على نفسه و النقص من التفاهة و التحلي بالجدية و العمل الجاد لتحقيق كل ما هو مرجو منه. عموما أتمنى أن يمر كل شيء بخير و أن أستطيع الإستيقاظ باكرا لصلاة الصبح إنشاء الله",
    "image": "",
    "date": "14/06/2023"
  },
  "day6": {
    "title": "a complicated Day Tirmi",
    "text": "كما كتبت البارحة ها أنا اليوم أمضي جل يومي في تغمي بطلب من خالد لمساعدته في تغشيش صديقته. رغم أني لم أقم بالكثير إلا أنني استنفذت وقتي اليومي كله في تراهات أبعد ما تكون عن الإفادة أو الإنتاجية. بل محض كتلة كبيرة من التفاهة التي أبتلعها كل يوم ظنا أن لا تأثير لها علي لكن العكس هو الصحيح. لم يكن يوما مثمرا حتى أنني لم أستيقظ أيضا لصلاة الصبح و لم أضع أية أهداف أصلا لليوم لأنني أعلم أنه سيكون معقدا. على كل علي أن أمضي يوما آخر مثله غدا مجددا في تغمي و بعدها سأعود إلى نظامي القاسي بإذن الله، و أيضا كي لا أنسى أن سكان إغير بتمثيل من أبي و العربي رئيس الجمعية و بعض الأشخاص الآخرين من القرية تم بفضل الله تركيب مضحة المياه في البئر أملا في تغطية حاجيات السكان المائية بطرق أسهل و أفضل.",
    "image": "",
    "date": "15/06/2023"
  },
  "day7": {
    "title": "A complicated Day but it's not an excuse",
    "text": "متعب جدا ولا أستطيع الكتابة كثيرا لكنني فشلت مجددا حتى في تحقيق هذه الأهداف البسيطة و قضيت أغلب يومي في تغمي و القليل في أنزي كذالك حيث أكملنا اليوم الثاني و الأخير من الإمتحان بمسعدتنا لخاليد لتغشيش صديقته كما أن مكز تعليم السياقة اليوم كان يحتوي على أناس أكثر بكثير من البارحة حيث جائت ثلاثة بنات و ولد و يجدر ذكر حادثة وقعت حيث ناداني خاليد أنا و مصطفى لنكون تجربة لمتهلمته التي تحداها بأن تقوم بشرح مفهوم في قانون السياقة لنا لتثبت ضبطها له و كان يتحدث عن مسافة علامات الخطر 'علامات مثلثة الشكل' داخل و خارج المدينة باختلاف أنواع الافتات.و أخيرا لابد أن أجد حلا لهذا التخاذل الذي أصابني و محاولة النهوض و قلب بعض الأمور",
    "image": "",
    "date": "16/06/2023"
  },
  "day8": {
    "title": "Another faile but i am puting an end to this",
    "text": "يوم آخر فاشل بعد سلسلة من الإخفائات يأتي هذا اليوم ليكملها. اليوم الذي لا أعرف حتى أين أضعته فلم أستيقظ حتى الساعة الثانية عشر و النصف و لم أتناول الفطور بل تناولت الغداء مباشرة. تم أمضيت فترة بعد الظهر في لعب الكرة و مشاهدة 'one punch man' الذي أنهيته اليوم للمرة الثالثة بموسميه الأول و الثاني. غدا ستأتي عائشة و أبنائها و سبق أن وصلت 'إبا مينا' اليوم لتصلح بذالك البيئة مزدحمة قليلا و سيصعب هذا علي الإلتزام الذي لم أقم به بشكل جيد سوى يومان. يومان فقط و ها أنا الآن أتخبط مرة أخرى و لا أستطيع الإنضباط لكنني لن أدع الأمور تستمر هكذا و سأعود إلى الإنضباط إنشاء الله",
    "image": "",
    "date": "17/06/2023"
  },
  "day9": {
    "title": "An empty day",
    "text": "يوم فارغ تماما بلا معنى أو هدف أو أي شيء ذو قيمة. لم أنجز أي شيء حتى أنني لم أصلي صلاة المغرب في المسجد. و مع تأخر الوقت الآن أشعر أن النفس تحاول السيطرة مرة أخرى بعد تخاذلي المستمر و إن لم أفعل شيء سريعا و تغييرا كبيرا سأعود مرة أخرى إلى الإنحطاط و اتباع الشهوات و الأهواء كالحيوانات التي لا تملك وعيا لتتحكم بأفعالها و أنا الذي كرمني الله بالعقل و مع ذالك أهوي نحو الشهوات و الغرائز. هذا منعرج خطير و مرحلة حرجة جدا إن لم أعد الآن فحتما سأسقط مجددا و العياذ بالله",
    "image": "20230619_005207.jpg",
    "date": "18/06/2023"
  },
  "day10": {
    "title": "A good and bad day",
    "text": "لا أعرف كيف أصف هذا اليوم من الوهلة الأولى أظن أنني أنجزت أكثر من الأيام السابقة و استيقظت لصلاة الفجر و كتبت بعض الأكواد و كذالك جمعت بعض المعلومات الجيدة حول الفريلانسين و خصوصا fiverr. لكن و مع كل هذه الإيجاليات فإن السلبيات أيضا كبيرة، حيث لم أستطع الإقتداء بيوسف مجددا و كدت أشرب من النهر لكن لحسن الحض مازلت أقاوم العطش الذي زاد بتغير المكان حيث جئت اليوم إلى أنزي باكرا و دخلت إلى بيئة يصعب فيها الإمتناع عن الشرب بسبب كثرة الأنهار و المياه العذبة الله ما ثبتنا على الطريق المستقيم و أعنا على طاعتك يا أرحم الراحمين يا رب العالمين",
    "image": "20230619_064303.jpg",
    "date": "19/06/2023"
  },
  "day11": {
    "title": "Disaster",
    "text": "لا أذكر الكثير من الأيام التي يمكنها تجاوز هذا اليوم من حيث السوء و الفظاعة. يوم بلا أهداف أو حتى ترفيه مضيع للوقت. رغم أنني بدأته بالبحث و ايجاد كورس جيد لأساسيات البرمجة إلا أنني بعدها سقطت، سقطت عميقا جدا ربما لم أكن أتخيل أن أصل إلى هذه الدرجة لكن الإنغماس في التفاهة و الإنحطاط و الوقاحة و فراغ الأوقات لا يمكن أن يأتي سوى بأشياء من هذه الشاكلة ربما لم أكن لأكتب هذه الفقرة أو أية فقرة بعدها لبعض الوقت أو ربما أمسح اليوميات السابقة لولا حفظ الله و رعايته. حيث استسلمت للسقوط و لم يكن يفصلني عنه سوى شعرة صغيرة من التشبت و المماطلة حتى أتاني حبل من الله على شكل نداء للعشاء انتشلني من حفرتي لأدرك بعدها هول ما كنت مقبلا عليه ربما لو عادت بي الأيام لم أكن لأغادر القرية حيث أن مخططاتي لم تنجح كما كنت أتصور و بدل العودة بالفائدة و المعرفة كدت أعود بالكارثة و الفضيحة أتمنى أن أستيقظ من خندقي و أخرج من كهفي الوردي و الهزلي المليء بالتفاهة و الشهوات و الإنحطاط، و الخروج إلى الواقع بحثا عن حياة تعمها الفائدة و الخير و الحلال اقتداء برسول الله صلى الله عليه و سلم",
    "image": "",
    "date": "20/06/2023"
  },
  "day12": {
    "title": "Empty but there is hope",
    "text": "لم يكن أفضل الأيام أو حتى من الأيام الجيدة. بل إنه يوم سيء مقارنة بالمتطلبات التي وضعتها. لم أستيقظ حتى الثانية عشر صباحا، حيث تفاجأت بوصول مصطفى و محمد قادمين من القرية ، ثم أمضيت فترة بعد الظهر في تصفح الحاسوب في محاولة لإنشاء شعار و بوستر للدوري الذي سينظم بقريتنا في أيام عيد الأضحى. في العصر وصل خالد و عمي بوجمع مع بطيخة أخدها مباشرة للسطح مع سكينة و تناولناها، ثم في المغرب توجهنا أخيرا إلى القرية رفقة براهيم بيمساع. رغم أنه لم يكن يوما جيدا لكنني أشعر بكثير من الأمل و التفائل نحو الغد و الأيام القادمة و أنا نتأكد بإذن الله ستعود الأيام المليئة بالإنتاجية و النشاط خصوصا مع كورس أساسيات البرمجة الذي حملته",
    "image": "",
    "date": "21/06/2023"
  },
  "day13": {
    "title": "Another empty day",
    "text": "يوم آخر فارغ قضيت جله في مشاهدة سلسلة لردات الفعل لليوتوبر راكان الشايع لسلسلة ون بيس. و بعد العصر خرجت إلى الملعب الجديد الذي لم يكتمل بعد و التقيت ب'kiss toi' هناك ساعدته على ضبط بعض الإعدادات في الهاتف. لعب الجميع كرة القدم إلا أنا لأن اصبع رجلي الصغير كان يألمني و أيضا لأنني لم أكن في مزاج جيد للعب. بعد صلاة المغرب في المسجد توجهت للمنزل بعدها وصل خاليد و تناولنا العشاء و ذهبنا كل إلى مكان نومه و ها أنا الآن لم أنم بعد و الساعة وصلت إلى الثاثة بعد منتصف الليل و ذالك لمحاولة الولوج إلى منصة 'outlook' للتعرف على نقطة الإمتحان الجهوي لكنني لم أتمكن من ذالك بعد و سأنام الآن و سأحاول مجددا صباحا",
    "image": "",
    "date": "22/06/2023"
  },
  "day14": {
    "title": "I am lackey",
    "text": "بعد استيقاظي المتأخر أكلت الغداء ثم رجعت إلى البيت العلوي و أمضيت فترة ما بعد الظهر مابين مواقع التواصل و محاولة الدخول إلى outlook بعد صلاة العصر و أكل وجبة أخرى ذهبت لأجرب لآخر مرة قبل أن أذهب للعب كرة القدم و نجحت في الدخول و حصلت على 15.35 في الإمتحان الجهوي لقد فرحت كثيرا بهذه النتيجة لكنني مازلت أعتقد أنني محظوظ قليلا لأنه مقارنة الجهد الذي بذلته في المراجعة و النقطة التي تحصلت عليها ليسا متساويين أبدا حيث أنني لم أبذل الكثير من الجهد خصوصا في مادة اللغة الفرنسية حيث أن الرواية التي امتحنا فيها هي الوحيدة التي راجعتها جيدا جدا من بين الثلاثة. حسنا آمل أن أحصل على نقطة أفضل في الباكالوريا السنة المقبلة و أنا عازم على بذل جهد أكبر إنشاء الله",
    "image": "",
    "date": "23/06/2023"
  },
  "day15": {
    "title": "Aid is close no more lyzyness",
    "text": "اليوم بعد الإستيقاظ الساعة العاشرة و تناول الغداء توجهنا رفقة خاليد إلى أنزي و أمضيت بقية اليوم على الحاسوب أنزل مقاطع الفيديو لأشاهدها لاحقا ثم ذهبت لقص شعري و قصدت الحلاق المجاور مباشرة لبيتنا ثم رجعت مرة أخرى للحاسوب في انظتر خاليد للعودة إلى القرية لكنني تفاجأت بعدم مجيئه و عليه فسأقضي الليلة في أنزي ثم أرجع إلى القرية غدا إنشاء الله فلم يبقى الكثير من الوقت حتى حلول عيد الأضحى و يجب أن أقضي حاجياتي و أتوقف عن الكسل و المماطلة",
    "image": "",
    "date": "24/06/2023"
  },
  "day16": {
    "title": "It's still the same",
    "text": "لا أستطيع الكتابة كثيرا لأنني أشعر بالنعاس. عموما لا شيء مميز في اليوم، يوم آخر فارغ و فاشل و خالي من أي انتاجية الحدث الأبرز فيه قدوم العامل لإتمام اصلاحات الملعب الجديد بالقرية حيث عدنا اليوم في الصباح إليها مجددا. لكن لسوء الحظ تعطلت مركبته حيث لم تعد تستطيع التقدم نحو الأمام أو نحو الخلف رغم أن المحرك يشتغل بشكل جيد. أنهى العامل ما استطاع اتمامه و قال بأنه سيعود في اليوم التالي مع مركبة أخرى لإتمام الأشغال. عموما أيام العيد تقترب و أنا لا أسعر أنني بأفصل حال جسديا و معنويا أتمنى أن يتغير هذا على الأقل معنويا لأنه هو الأهم",
    "image": "",
    "date": "25/06/2023"
  },
  "day17": {
    "title": "Hard need strength",
    "text": "الوقت متأخر جدا. أبرز ماحدث اليوم اكمال الأشغال صباح اليوم و قدوم عمتي فاطمة من عند أهلها لقرب العيد و هي جدة الياس و أسماء. ربما هذه أهم الأحداث لهاذا اليوم العصيب حيث أنني لا أشعر أنني بخير جديا و معنويا كذالك أنا عطشان مجددا و عدت إلى التقرب من النهر و أخاف أن أشرب مائه مجددا. لن يحدث هذا بإذن الله و سأصبر فالصبر جميل و أجره عند الله كبير",
    "image": "",
    "date": "26/06/2023"
  },
  "day18": {
    "title": "Lost",
    "text": "يوم فارغ جدا لم أفعل أي شيء يذكر سوى الضياع في الظلام و محاولة الشرب من النهر. حتى أن عقلي يختلق أمورا سخيفة و غبية لإقناعي بالشرب منه، أشعر بالضعف و أعرف أني في مرحلة خطيرة جدا قد لا أخرج منها سالما خصوصا أني بتت أقضي معضم الوقت خلف شاشة الحاسوب من دون فائدة أشاهد محتوى تافه و سخيف طوال اليوم و هذا ينعكس على صحتي النفسية و الجسدية، يجب أن أفعل شيء سريعا لوقف هذا التدهور الذي يبدو أن آخره هو شرب من النهر و العودة إلى الصفر، أتمنى أن لا يحصل هذا مجددا",
    "image": "",
    "date": "27/06/2023"
  },
  "day19": {
    "title": "I did it, maybe i don't deserve to live",
    "text": "عند اعادة النظر إلى الأحداث التي حصلت في الأيام السابقة ستوقن أن هذه كانت الخطوة القادمة لا محالة. يوم أسود من أسوء أيام حياتي لا أعرف مذا أفعل شربت من النهر رغم أنني أعلم أن الشرب منه غير مقبول بكل الأشكال لكنني شربت بسبب ضعفي الشديد كيف لشخص لا يستطيع السيطرة على غرائزه أن يطمح للتفوق كيف يريد مناصب للتحكم و اصدار القرار و هو لا يستطيع التحكم بأفعاله و تغلبه غريزته في كل مرة هل حقا هناك نهاية لهذه الحلقة ربما لو لم أجرب من قبل لنفيت وجودها لكنني وصلت للنهاية بالفعل ذات مرة لكنني سقطت و لا أستطيع العودة مرة أخرى. مذا تغير؟ لا أعرف لكن غالبا التغيير الذي حصل هو الفراغ الشاسع الذي أعيشه و عدم وجود أشياء مفيدة أشغل بها وقتي و كذالك فقدان التركيز و التشتيت و ضعف التحمل و الإنقياد للغريزة التي يروضها الإنسان السوي لخدمة مصالحه و مصالح مجتمعه بينها تروضني أنا لخدمة نفسها",
    "image": "",
    "date": "28/06/2023"
  },
  "day20": {
    "title": "Aid day",
    "text": "اليوم يوم العيد يوم عظيم جدا استيقظت باكرا و صليت في المصلى الجديد حيث كان الحاج عبلا أمجود عصبيا جدا و يريد الصلاة في أسرع وقت و هذا أظفى طعما سيئا على الجو العام للصلاة. بعد الذبيحة و تناول الكباب غفوت قليلا ثم تناولنا الغذاء و توجهت بعدها أنا و خاليد لإصلاح تسرب لمياه الشرب عند منزل موستيك و انضم إلينا الريس العربي و بابا الحوس. بعدها تجوجهنا لملئ الأواني بالمياه و تخزينها. ثم أمضيت قلايلا من الوقت على الهاتف ثم تناولنا وجبة خفيفة و توجهنا إلى الملعب الجديد و باشرنا العمل على ابعاد الأحشار منه ليصبح أكثر قابلية للعب. بعدها رجعنا إلى البيت و تناولنا العشاء ثم ها أنا الآن في المقر لتوزيع الاعبين على الفرق انتهينا تقريبا الآن و سأذهب إلى النوم بعد قليل عموما يوم جيد إلى متوسط بعد الكارثة لكن أطمح إلى الأفضل إنشاء الله",
    "image": "",
    "date": "29/06/2023"
  },
  "day21": {
    "title": "Pain,lost,fail,stupid",
    "text": "لا أملك الوجه و الحق في الحديث لأنني نكرة أهوى السقوط و الفشل و التفاهة في هذا اليوم المظلم لا لشيء إلا بسبب أفعالي",
    "image": "",
    "date": "30/06/2023"
  },
  "day22": {
    "title": "I am not done yet",
    "text": "لا أستطيع فتح عيناي رغم النهوض المتأخر و الفعل الذي تلاه مباشرة إلا أنني لم أستسلم بعد و أنا عائد بإذن الله.عموما أبرز ما حدث اليوم هو أننا ربحنا مباراتنا في دوري إغير وسعدون و أن فريق مصطفى و عبد السلام خسر بثمانية . أي بنتيجة تقيلة جدا جدا عموما يوم متوسط و عودة جديدة أتمنى أن تستمر",
    "image": "",
    "date": "01/07/2023"
  },
  "day23": {
    "title": "Hard but i am not done",
    "text": "يوم جديد من أيام العيد نهضت متأخرا كالعادة فطرنا،ثم بعدها بقليل تناولنا الغداء من تحضير 'بابوجمع'. مرت فترة مابعد الضهر بسرعة كبيرة جدا ثم بعدها بدأت التجهيزات للمباراة، صليت و تناولت وجبة خفيفة ثم انطلقنا الى الملعب، تفاجئت بغياب لاعبين مهمين في فريقي و أنني لم أكن في حالة جيدة للعب حيث كنت أعاني من بعض الألم في الإصبع الأكبر للرجل. فأنزلت سقف الطموحات و بدأت المباراة و لعبنا بشكل جيد حتى أنني سجلت الهدف الثاني لكن بسبب سوء استلام للكرة و ضغط من لاعب الخصم و سوء أرضية الميدان أصبت اصابة صعبة في نفس المكان (الإصبع الأكبر للرجل).بعدها أنهيت الشوط الأول و أنا أتمشى لعدم وجود أي لاعب في الإحتياط، رغم ذالك أنهينا الشوط الأول متفوقين. لكن في الشوط الثاني خسرنا للأسباب التي ذكرتها سابقا خصوصا عدم وجود لاعبين في الإحتياط. بعد المباراة بقليل أحسست بهول الإصابة التي تعرضت لها حيث لم أستطع الوصول إلى البيت إلا بصعوبة و أتوقع حقا أنه كسر لأن الألم كبير و انفخ مكان الإصابة كذالك. عموما يوم عادي ليس شيء فريدا من حيث الإنتاجية بل بدأت أعراض العطش تظهر مرة أخرى لكنني صامد إنشاء الله",
    "image": "",
    "date": "02/07/2023"
  },
  "day24": {
    "title": "A lot of noise",
    "text": "اليوم نهائي الدوري الوقت جد متأخر و المكان صاخب بسبب الحفل الختامي للدوري الذي شهد هذا العام وجود مجموعات موسيقية كانت الشيء الأبرز في الحفل . شاهدت الكثير من الوجوه اليوم منها المألوف و غير المألوف لكن الحمد لله انتهى كل شيء على خير رغم الحشد الكبير الذي جاء قبيل نهاية الحفل بقليل الذي ربما كان سيسفر عن الكثير من المشاكل لو أتى مبكرا و لكن لحسن الحظ لم يأتو إلا بعد أن شارفنا على الإنتهاء و وجوههم يغلب عليها الهمجية و الحيوانية حتى أنه كان هناك أشخاص خارجين عن وعيهم بسبب الكحول و المخدرات من بينهم كان شخص واضح جدا اسمه 'أيوب لباز'. مع كل هذا كان الحفل جيدا جدا حيث مضى جله في أجواء رائعة و لا يمكن للدقائق الأخيرة أن تغير ذالك.",
    "image": "20230704_034741.jpg",
    "date": "03/07/2023"
  },
  "day25": {
    "title": "Lost",
    "text": "تائه في النهر و أكاد أغرق",
    "image": "",
    "date": "04/07/2023"
  },
  "day26": {
    "title": "Week up you stupid",
    "text": "يوم كئيب ضائع لكنني لا أخطط للبقاء على هذه الحالة. حان وقت التجديف للخروج من هذا النهر. و كلي عزيمة و أمل في تخطي هذه المحنة و سأتمكن من ذالك إنشاء الله الآن وقت العمل و النشاط و بذل الجهد للخروج من هذه الدوامة المروعة",
    "image": "",
    "date": "05/07/2023"
  },
  "day27": {
    "title": "Still going",
    "text": "اليوم استيقظت مبكرا نسبيا في التاسعة على اعتبار أنني نمت متأخرا جدا البارحة. ساعدت أمي في الغسيل حيث تكلفت بنشره بينما هي تغسله و جلبت لها بعض الماء مع أنه شيء قليل جدا لا يستحق الذكر لكن على الأقل أنجزت شيء ذا قيمة. يوم جيد أفضل بكثير من الأيام السابقة بدأت أرسم الطريق و عندي بعض الأفكار لمشروع صفحة ويب شخصية أتمنى أن أستمر هكذا حيث أخطط غدا أن أقوم بعملية صوم الدوبامين ربما ستكون صعبة لكنني لها بإذن الله و القادم أفضل انشاء الله",
    "image": "",
    "date": "06/07/2023"
  },
  "day28": {
    "title": "Dopamine fast",
    "text": "اليوم استيقظت كما كان مخططا على الساعة الخامسة صباحا و صليت صلاة الصبح ثم نزلت إلى البيت السفلي و ذهبت إلى غرفة أمي جلست قليلا لم أكن أنوي النوم لكن غفوت قليلا حتى سمعت صوت عمتي إجو تستعد للرحيل فنهظت و نزلت و شربت الحريرة ثم خرجت إلى الخارج للإستمتاع بأجواء الصباح الرائعة بعدها دخلت و ذهبت لغرفتي في البيت العلوي قصد قرائة كتاب رحلة الدجال الناعمة لكنني و لشدة تعبي بسبب سهر اليوم السابق غفوة مرة أخرى. ثم استيقظت بعدها و نزلت مرة أخرى و فطرت ثم رجعت وبدأت العمل على اكمال تصميم موقعي. بعدها أكلت الغداء و ذهبت للنوم نمت ساعتين و استيقظت في الخامسة مساء ثم صليت صلاة العصر و لعبت الكرة قليلا حتى وصل خاليد و تناولنا وجبة خفيفة ثم أقل بعدها مريم و حسناء إلى أنزي. خرجنا بعدها للخارج و جلسنا قليلا نتبادل الحديث مع الجماعة ثم قررنا ارجاع الدكاكة الصغيرة من الملعب كانت ثقيلة لكن نجحنا. عدنا بعدها للمنزل و صليت العصر ثم العشاء و وضعت بعض اللمسات الإضافية على تصميم الموقع ثم أكلنا العشاء و ها أنا أستعد للنوم بعد أن أكمل هذه الفقرة. كان يوم رائعا حاولت الأمواج في النهر جذبي لكنني لم و لن أتوقف عن التجديف",
    "image": "20230707_082057.jpg",
    "date": "07/07/2023"
  },
  "day29": {
    "title": "Another step",
    "text": "اليوم استيقظت مرة اخرى على الخامسة صليت ثم عدت بعدها للنوم حتى السابعة و النصف حيث استيقظت و نزلت الى المنزل السفلي و شربت الحريرة ثم خرجت الى الخاج قليلا بعدها فطرت و بدأت العمل على اتمام تصميم الموقع حيث انتهيت تقريبا بقيت فقط بعض اللمسات لأنتقل بعدها نحو كتابة الكود. بما أنه يوم السبت فقد أتى أبي اليوم مع بابا لحوس و أخطط للذهاب غدا الى أنزي ثم العودة مرة أخرى مع السيارة لكن هذا يعتمد على الأشخاص و الأماكن الشاغرة في السيارة عموما أتمنى أن أتمكن من الذهاب كي أقضي بعض الحاجيات هناك وفق ما خططت.",
    "image": "IMG-20230724-WA0000.jpg",
    "date": "08/07/2023"
  },
  "day30": {
    "title": "Good day and still going",
    "text": "اليوم استيقظت كما خططت و ذهبت الى أنزي لأنه يوم الأحد حاولت الإتصال بشبكة وايفاي المقهى باستعمال الحاسوب لكنخا أبت أن تعمل حيث تتصل لكنها بدن انترنت. عموما نمت قليلا ثم خرجت إلى السوق تجولت لم يكن هناك شيء ملفت أو مثير للإهتمام رغم أنني لم أزر سوق الأحد بأنزي مند فترة طويلة الشيء الملفت الوحيد الذي وقع هو عثوري على عشرين درهما واقعة على الأرض فأخذتها لم أستطع الشعور بالفرح كليا لأنني أفكر في الشخص الذي فقدها ربما كان في أمس الحاجة إليها. بعدها فطرنا ثم قابلت خالي سعيد قرب المنزل كان يمزح حول طولي و كيف كبرت لأنه لم يرني منذ مدة طويلة. رجعنا بعدها إلى القرية و رجع خاليد مرة أخرى لإيصال أخته و أمه إلى تنزنيت تم عاد بعدها. بدأت أخيرا في مرحلة كتابة الأكواد بعد الإنتهاء من التصميم آمل أن أنتهي قريبا لأشرع في شيء أكثر أهمية ، و عند اقتراب المغرب ذهبنا الى المسجد للإستعداد للعشاء المقام فيه بمناسبة ختم القرآن الذي يحدث كل شهر تقريبا أكلنا و قرأنا الحزب الستون بعها رجعت أنا إلى المنزل الآن بينها تركت مصطفى و محمد في الخارج لم يدخلو بعد لأنني أود أن أنام باكرا لأستعد ليوم جيد آخر إنشاء الله",
    "image": "IMG-20230724-WA0001.jpg",
    "date": "09/07/2023"
  },
  "day31": {
    "title": "Drop but still going",
    "text": "اليوم لم يكن بنفس مستوى الأيام السابقة نتيجة الكسل و السهر ليلة البارحة حيث لم أنجز الشيء الكثير في مرحلة كتابة الأكواد حيث كنت أنوي اكمال جزء css على الأقل اليوم لكن لم استطع بسبب التخاذل و التكاسل حيث قلت الصرامة قليلا و دخل بعض الترفيه في مرحلة العمل مما سبب خلل في الدوبامين و شعرت بالملل عكس المعتاد و ضيعت الكثير من الوقت دون القيام بأي شيء واضح بين الكلام و الدردشة مع الأهل أو مصطفى و أيضا كتاب المعسول الذي أمضيت وقتا كبيرا أبحث فيه عن تاريخ عائلتي لكن لم أجده بعد. عموما لابد أن أعيد شحن نفسي و أعود أقوى غدا مع الكثير من العمل و الإنتاجية انشاء الله.",
    "image": "Screenshot_20230711-004816.jpg",
    "date": "10/07/2023"
  },
  "day32": {
    "title": "not bad but i want more",
    "text": "اليوم لم استيقظ حتى العاشرة و بدأت العمل على الحادية عشر على عكس ما كنت أطمح لكنني أنهيت جزء جيدا من الموقع حيث ركزت على جزء responsive اليوم و قمت بعمل جيد لكنني أريد أكثر من هذا علي تخصيص ساعات أكثر من أجله و العمل بسرعة لأنني لاحظت بطئي الشديد أثناء العمل حيث أقضي أوقات طويلة في بعض الأحيان أفكر في حيرة حول شيء ليس بذالك الأهمية أو أن أحاول تطبيق شيء صعب لست متمكنا منه جيدا لكن على العموم يوم عادي و ساخن خصوصا هنا في اغير حيث يمكننا القول أن الصيف قد بدأ الآن ليس المفضل لدي حيث أحب الفصول الباردة و المعتدلة أكثر ربما الشيء الأجمل في هذا الفصل هو العطلة الصيفية التي تتيح لك متسعا من الوقت، أنوي استثمارها بشكل جيد جدا إنشاء الله",
    "image": "",
    "date": "11/07/2023"
  },
  "day33": {
    "title": "not the best but i keep going",
    "text": "لم أستيقظ مرة أخرى لصلاة الصبح بل استيقظت على السابعة شربت الحريرة تزامنا مع رحيل أبي و خاليد لأنه يو الأربعاء.عموما رجعت الى البيت العلوي و شغلت الحاسوب و بدأت العمل رغم شعوري الشديد بالنعاس فجأة انقطع التيار فنمت و لم استيقظ حتى التاسعة و النصف جربت المصباح لكن الكهرباء ما زال منقطعا نزلت الى المنزل السفلي و من شدة التعب نمت مرة أخرى في 'أسراك' بعد مدة استيقظت و فطرت و فوجئت أن سبب انقطاع الكهرباء كان انتهاء الرصيد و عادت الكهرباء مرة أخرى بعد إدخال أمي البطاقة للتجديد الرصيد، لو كنت أعلم لأدخلتها بدل النوم و انتظار رجوعها. عموما لم أعمل أي شيء في الفترة الصباحية جل ما أنزته في الكود كان بعد الزوال ليس ما كنت أطمح لإنجازه لكن على الأقل أفضل من لا شيء و أرجو أن يكون غدا أكثر انتاجية انشاء الله",
    "image": "",
    "date": "12/07/2023"
  },
  "day34": {
    "title": "It didn't start that good but it ends very good",
    "text": "اليوم لم استيقظ لصلاة الفجر مجددا هذا أغضبني حقا لأنني أستيقظ بعها بساعتين أي أنني نمت فقط كي لا أصلي عموما نهضت حوالي السابعة توضأت و صليت ثم نزلت و شربت الحريرة كالعادة بعدها نمت مجددا في 'أسراغ' نمت نموا أفضل من الذي نمته في الليل حيث كان الجو ساخنا جدا لم أستطع النوم على راحتي لكن هنا في 'أسراغ' كان الجو لطيفا ليس باردا و ليس ساخنا. عموما نهضت مرة أخرى وفطرت ببطئ ثم توجهت للعمل بدأت و في ذهني أن أكمل الجزء الخاص بالتنسيقات لأنتقل إلى جزء الجافاسكريبت أنجزت بعض العمل ثم ذهبت للغذاء بعها عدت لأكمل العمل و بقيت على هذه الحالة حتى آذان العصر نزلت و أكلت وجبة خفيفة لعبت الكرة قليلا ذهبت لأسلم أجزاء البلاغي للحوس لكنني لم أجده فعلقتها في مقبض الباب. صليت العصر أعلم أني تأخرت لكن الشيطان لا يفتئ يأخرني عنها بعدها تصفحت الفايسبوك قليلا حتى آذان المغرب صليت ثم عدت إلى المنزل العلوي كنت أنوي فقط مشاهدة بعض المحتوى الترفيهي لكنني بدأت بإكمال ما تبقى من الكود و أخيرا انتهيت على الساعة الواحدة و أربيعين دقيقة بعد منتصف الليل أشعر بتعب شديد و علي النوم خصوصا أنني ذاهب إلى أنزي غدا إنشاء الله. عموما يوم منتج و رائع من حيث الإنتاجية هذا هو المستوى الذي أطمح إليه و علي جعله المستوى الطبيعي للإنتاجية يوميا.",
    "image": "20230713_070951.jpg",
    "date": "13/07/2023"
  },
  "day35": {
    "title": "A day off but it's for good",
    "text": "اليوم ذهبنا إلى أنزي فاجئتني الحرارة الكبيرة جدا كنت أنوي قضاء يومين لكنني رجعت في نفس اليوم رفقة خاليد حيث كان هو الذي أقلنا في الصباح رفقة إبا التي أرسلناها في سيارة الأجرة الى تزنيت. عموما لم أنجز الكثير حيث جل ما فعلته هو انهاء جزء صغير خاص بالresponsive و بعدها قضيت باقي اليوم أنزل سلسلات tutorials حول css و JavaScript و front-end عموما نزلت كمية لا بأس بها مازال في ذهني المزيد من الأشياء و الكورسات أريد تنزيلها أتمنى أن أحدث قفزة كبيرة في مستواي هذا الصيف إنشاء الله.",
    "image": "20230714_070931.jpg",
    "date": "14/07/2023"
  },
  "day36": {
    "title": "I am late but still going",
    "text": "تأخرت كثيرا في الإستيقاظ حيث لم أستيقظ حتى الحادية عشر صباحا فطرت ثم أنجزت جزء صغيرا من الJavaScript ثم أكلنا الغداء اليوم يوم السبت و خاليد لا يعمل و تغدى معنا حيث أكلنا 'تاغارين' عموما رجعت بعها و بدأت العمل فعليا و تمكنت من اتمام جزء لا بأس به الجزء الخاص بmaster challenge لكن القادم أصعب لكنني أشعر بالحماس تجاه الأمور الجديدة التي سأتعلمها و أتعرف عليها رغم أنني ما زلت أعتقد أنني أستطيع بذل جهد أكبر و تخصيص وقت أكثر لها و ما يأرقني أكثر هو سلسلة الأيام التي لا زالت مستمرة التي لم استيقظ فيها لصلاة الصبح أعتقد أني تهاونت قليلا يجب أن آخد الأمور بجدية أكثر و أكسر هذه السلسلة غدا إنشاء الله",
    "image": "",
    "date": "15/07/2023"
  },
  "day37": {
    "title": "Marriage but not a good day",
    "text": "اليوم لم أنجز شيئا إنها الخامسة صباحا الآن و لازلت مستيقظا بسبب العرس الذي ما زالت مراسيمه مستمرة حيث نحن الآن بصدد 'تنغيفت' يجدر الذكر أن العرس أقيم بتافراوت ذهبنا إليها أنا و مصطفى و خاليد لست فخورا أو سعيدا بهذا اليوم لم أصلي سوى صلاتين فقط لهذا أكره المكوث في غير منزلك طويلا طبعا هناك مساجد في كل مكان لكن حتى الصحبة لا تساعدك على ذالك عموما كلها أعذار لا تعفني من هذا الخطء الكبير جدا أتمنى من الله أن يغفر لي و لكل المومينين و المومينات إنشاء الله.",
    "image": "20230716_215958.jpg",
    "date": "16/07/2023"
  },
  "day38": {
    "title": "Another day has gone",
    "text": "اليوم بعد العرس أمضيت جله في النوم حيث نمت على الساعة الثامنة و لم أستيقظ حتى الرابعة بعد الظهر لم يكن نوما جميلا خصوصا أنني نمت في تيغمي مقر عمل خاليد بسبب ضيق الوقت حيث لم يكن هناك وقت للعودة إلى إغير لأن خاليد يبدأ العمل من الثامنة صباحا لذالك قدمنا من أيت بها مباشرة إلى تغمي. عموما ضيعت يوما آخر في النعاس و الآن بعد عودتي إلى إغير علي الدخول في طور الإنتاجية مجددا ابتداء من الغد إنشاء الله",
    "image": "",
    "date": "17/07/2023"
  },
  "day39": {
    "title": "not the top but it's a comeback",
    "text": "تستمر السلسلة و لا أستيقظ مجددا لصلاة الصبح بعد يومان منعدمي الإنتاجية يأتي اليوم متوسط إلى جيد حيث أنجزت جزء مهما من مرحلة الJavaScript و لم يبقى الكثير حتى يكتمل المشروع و أرى هذه التدوينة على الموقع عوض google notes لكن بدأت أشعر أنني قضيت الكثير من الوقت على هذا المشروع ربما أكثر من الازم يجب أن أنهيه في حدود يوم أو يومين على الأكثر لأن هناك الكثير من الأشياء الأخرى التي أريد العمل عليها.الجدير بالذكر أنني ربما أصبت بزكام لا أشعر بأنها سيئة الآن لكن ربما تتطور غدا و ستبطء تقدمي لكن قدر الله ما شاء فعل نتمنى الشفاء بإذن الله لا شفاء إلا شفائه تعالى.",
    "image": "",
    "date": "18/07/2023"
  },
  "day40": {
    "title": "A day off",
    "text": "اليوم كما توقعت نهظت بحالة سيئة حيث تملكني الدوار و لا أستطيع حتى المشي بطريقة جيدة أو سريعة لكن هذا لم يكن الأسوء حيث شربت القليل من الحساء لم يلبث كثيرا في معدتي حيث أصبت بالغثيان مرتين لكن بعد أكل القليل من الأرز و شرب دواء 'الفنيز أو كايو' بعدها بلحظات شعرت بتحسن لكن مع اقتراب العشاء بدأت بعض الأعراض تعود مرة أخرى فأكلت الأرز مجددا و شربت نفس الدواء و ها أنا الآن أستعد للنوم أدعو الله أن يشفيني و يشفي سائر المسلمين و المسلمات بقدرته إنشاء الله",
    "image": "IMG-20230724-WA0002.jpg",
    "date": "19/07/2023"
  },
  "day41": {
    "title": "Another day off",
    "text": "ما زلت الييوم مريضا ربما أسوء من البارحة لا يوجد الكثير لأقوله غير أنني قضيت اليوم مجددا في الإستلقاء الحمد لله على كل حال اشفني أنت الشافي لا شفاء إلا شفائك",
    "image": "",
    "date": "20/07/2023"
  },
  "day42": {
    "title": "Its the Third day off but i am good",
    "text": "اليوم الثالث من أيام المرض لم أنم الليل مجددا و نهظت فور بزوغ الشمس شربت الحريرة و جلست قليلا أتأمل حالتي حينها ما زالت حالتي سيئة و ما زلت أشعر بالدوار و ألم في الأطراف لكن و لله الحمد بعد تناول الغذاء رغم أني لم أكل سوى القليل شعرت ببعض التحسن حتى أنني خرجت مع مصطفى و الحسان بعد الظهر و جلسنا تحت شجرة مع لعربي بن براهيم . عموما بدأت أشعر بتحسن كبير في حالتي و أنني قد تخطيت المرض بفضل الله لقد كلفني الكثير من الوقت ثلاثة أيام بدون عمل لكن قدر الله ما شاء فعل إنشاء الله سوف أعود للعمل غدا و بقوة أكثر بإذن الله تعالى",
    "image": "",
    "date": "21/07/2023"
  },
  "day43": {
    "title": "Not the best but a goid comeback",
    "text": "اليوم نمت جيدا الحمد لله و استيقظت رغم أني تقريبا شفيت من المرض إلا أن بعض الآثار لا زالت باقية حيث كنت متعبا جدا لهذا لم أنجز الكثير لكن على الأقل أتممت بعض المهام على أمل انجاز شيء أكثر غدا رغم أنني تأخرت جدا في النوم و لن أستطيع الإستيقاظ باكرا لكنني عازم في كل الأحوال على انجاز جزء جيد من العمل غدا لأنني تواق لإنهاء هذا المشروع الذي طال كثيرا حيث كنت أنوي انهائه بحلول اليوم لكن المرض حال دون حدوث ذالك قدر الله ما شاء فعل ليست مشكلة كبيرة و أنا واثق انشاء الله من قدرتي على انهائه في الوقت",
    "image": "",
    "date": "22/07/2023"
  },
  "day44": {
    "title": "Bad news",
    "text": "اليوم نمت حتى وقت متأخر و استيقظت غافلا عن ما يجري إذ بي أتفاجئ أن الجميع ذهب إلى أكادير لأن خالي الحاج العربي مات رحمه الله تفاجئت كثيرا و جلست فترة لأستوعب الأمر فعلا لا يمكن توقع أي شيء بخصوص هذه الحياة تأتي الأشياء دائما على غفلة. عموما أتت عمتي من أنزي لتغطي غياب أمي التي ذهبت هي أيضا إلى أكادير . أما بخصوص العمل فقد أنجزت جزء بسيطا لكنني لا زلت غير راضي عن مستوى عملي خصوصا أنني لم أعمل في الصباح و خسرت هذا الكم من الساعات الثمينة لكن الجدير بالذكر أنني على وشك الإنتهاء من المشروع لم يبقى سوى القليل الحمد لله",
    "image": "",
    "date": "23/07/2023"
  },
  "day45": {
    "title": "It took soo long but finally it ends",
    "text": "اليوم مازلت عند تخاذلي و لم أستطع الإستيقاظ باكرا مجددا علي حقا وضع حد لهذه السلسلة الجدير بالذكر أنني قضيت وقت لا بأس به في مشاهدة أعمال الطريق التي كانت اليوم بالقرب من المنزل عدت بعدها إلى المنزل العلوي و بدأت العمل تقريبا على الساعة 3:40 نعم وقت متأخر جدا و تمكنت أخيرا بعد عناء و الكثير من العقبات من إنهاء مشروعي بقي فقط ادخال بعض الداتا و أنا تقريبا أنهيت هذا أيضا أنا الآن متحمس للمستقبل و إلى أين يمكن أن أصل لكنني ما زلت أصر على أن السبيل لتحقيق أكبر استفادة من هذه العطلة الصيفية هي بالعمل لأكبر عدد من الساعات في اليوم و سأحوال هذا إنشاء الله",
    "image": "",
    "date": "24/07/2023"
  },
  "day46": {
    "title":"A new area but still not clear",
    "text":"اليوم أول يوم بعد الإنتهاء من المشروع لم يكن كما توقعته واجهت بعض العقبات و التأخيرات التي أددت بي إلى العمل لفترة صغيرة فقط مثل أعمال الطريق التي كنت أراقبها و أتفقدها مرارا و تكرارا و كذالك قناة التلفاز الجديدة التي تجذبني و تضيع جزء كبيرا من وقتي رغم أنني لست في فترة الترفيه لكن مصطفى يشاهد التلفاز يوميا لذالك القناة تنجح بجذبي و تضييع وقت ثمين مني عموما أنوي استغلال و استثمار وقت أكثر في هذا الشغل لزيادة أكبر قدر ممكن من المعلومات و الفائدة إنشاء الله",
    "image":"",
    "date":"25/07/2023"
  },
  "day47": {
    "title": "Still the same",
    "text": "اليوم يمكن القول أنه نسخة من الأمس غير أننا لم نخرج اليوم إلى 'دو إغرم' لكن عموما بدأت اليوم متأخرا مجددا و أمضيت الكثير من الوقت في مراقبة أشغال الطريق و كذالك القناة الجديدة التي حتى إن لم أشاهدها تأخد مني الكثير من الوقت كل هذا مع تهاوني الذي زاد مؤخرا بشكل كبير حيث أسهر على مشاهدة القناة و لا أستيقظ لصلاة الصبح لا أذكر حتى آخر مرة نهظت لصلاة الصبح منذ و قت طويل جدا على الأرجح هذا ليس ما أطمح له العطلة الصيفية انتصفت تقريبا لم يبق الكثير على نهاية هذا الكم الكبير من أوقات الفراغ اليومية و سيكون علي العودة للدراسة مجددا آمل أن أستغل هذه الأوقات بشكل جيد إنشاء الله",
    "image": "",
    "date":"26/07/2023"
  }
  
},"duringChallenge":{
  "day1": {
    "title": "Dopamine fast",
    "text": "اليوم استيقظت كما كان مخططا على الساعة الخامسة صباحا و صليت صلاة الصبح ثم نزلت إلى البيت السفلي و ذهبت إلى غرفة أمي جلست قليلا لم أكن أنوي النوم لكن غفوت قليلا حتى سمعت صوت عمتي إجو تستعد للرحيل فنهظت و نزلت و شربت الحريرة ثم خرجت إلى الخارج للإستمتاع بأجواء الصباح الرائعة بعدها دخلت و ذهبت لغرفتي في البيت العلوي قصد قرائة كتاب رحلة الدجال الناعمة لكنني و لشدة تعبي بسبب سهر اليوم السابق غفوة مرة أخرى. ثم استيقظت بعدها و نزلت مرة أخرى و فطرت ثم رجعت وبدأت العمل على اكمال تصميم موقعي. بعدها أكلت الغداء و ذهبت للنوم نمت ساعتين و استيقظت في الخامسة مساء ثم صليت صلاة العصر و لعبت الكرة قليلا حتى وصل خاليد و تناولنا وجبة خفيفة ثم أقل بعدها مريم و حسناء إلى أنزي. خرجنا بعدها للخارج و جلسنا قليلا نتبادل الحديث مع الجماعة ثم قررنا ارجاع الدكاكة الصغيرة من الملعب كانت ثقيلة لكن نجحنا. عدنا بعدها للمنزل و صليت العصر ثم العشاء و وضعت بعض اللمسات الإضافية على تصميم الموقع ثم أكلنا العشاء و ها أنا أستعد للنوم بعد أن أكمل هذه الفقرة. كان يوم رائعا حاولت الأمواج في النهر جذبي لكنني لم و لن أتوقف عن التجديف",
    "image": "20230707_082057.jpg",
    "date": "07/07/2023"
  },
  "day2": {
    "title": "Another step",
    "text": "اليوم استيقظت مرة اخرى على الخامسة صليت ثم عدت بعدها للنوم حتى السابعة و النصف حيث استيقظت و نزلت الى المنزل السفلي و شربت الحريرة ثم خرجت الى الخاج قليلا بعدها فطرت و بدأت العمل على اتمام تصميم الموقع حيث انتهيت تقريبا بقيت فقط بعض اللمسات لأنتقل بعدها نحو كتابة الكود. بما أنه يوم السبت فقد أتى أبي اليوم مع بابا لحوس و أخطط للذهاب غدا الى أنزي ثم العودة مرة أخرى مع السيارة لكن هذا يعتمد على الأشخاص و الأماكن الشاغرة في السيارة عموما أتمنى أن أتمكن من الذهاب كي أقضي بعض الحاجيات هناك وفق ما خططت.",
    "image": "IMG-20230724-WA0000.jpg",
    "date": "08/07/2023"
  },
  "day3": {
    "title": "Good day and still going",
    "text": "اليوم استيقظت كما خططت و ذهبت الى أنزي لأنه يوم الأحد حاولت الإتصال بشبكة وايفاي المقهى باستعمال الحاسوب لكنخا أبت أن تعمل حيث تتصل لكنها بدن انترنت. عموما نمت قليلا ثم خرجت إلى السوق تجولت لم يكن هناك شيء ملفت أو مثير للإهتمام رغم أنني لم أزر سوق الأحد بأنزي مند فترة طويلة الشيء الملفت الوحيد الذي وقع هو عثوري على عشرين درهما واقعة على الأرض فأخذتها لم أستطع الشعور بالفرح كليا لأنني أفكر في الشخص الذي فقدها ربما كان في أمس الحاجة إليها. بعدها فطرنا ثم قابلت خالي سعيد قرب المنزل كان يمزح حول طولي و كيف كبرت لأنه لم يرني منذ مدة طويلة. رجعنا بعدها إلى القرية و رجع خاليد مرة أخرى لإيصال أخته و أمه إلى تنزنيت تم عاد بعدها. بدأت أخيرا في مرحلة كتابة الأكواد بعد الإنتهاء من التصميم آمل أن أنتهي قريبا لأشرع في شيء أكثر أهمية ، و عند اقتراب المغرب ذهبنا الى المسجد للإستعداد للعشاء المقام فيه بمناسبة ختم القرآن الذي يحدث كل شهر تقريبا أكلنا و قرأنا الحزب الستون بعها رجعت أنا إلى المنزل الآن بينها تركت مصطفى و محمد في الخارج لم يدخلو بعد لأنني أود أن أنام باكرا لأستعد ليوم جيد آخر إنشاء الله",
    "image": "IMG-20230724-WA0001.jpg",
    "date": "09/07/2023"
  },
  "day4": {
    "title": "Drop but still going",
    "text": "اليوم لم يكن بنفس مستوى الأيام السابقة نتيجة الكسل و السهر ليلة البارحة حيث لم أنجز الشيء الكثير في مرحلة كتابة الأكواد حيث كنت أنوي اكمال جزء css على الأقل اليوم لكن لم استطع بسبب التخاذل و التكاسل حيث قلت الصرامة قليلا و دخل بعض الترفيه في مرحلة العمل مما سبب خلل في الدوبامين و شعرت بالملل عكس المعتاد و ضيعت الكثير من الوقت دون القيام بأي شيء واضح بين الكلام و الدردشة مع الأهل أو مصطفى و أيضا كتاب المعسول الذي أمضيت وقتا كبيرا أبحث فيه عن تاريخ عائلتي لكن لم أجده بعد. عموما لابد أن أعيد شحن نفسي و أعود أقوى غدا مع الكثير من العمل و الإنتاجية انشاء الله.",
    "image": "Screenshot_20230711-004816.jpg",
    "date": "10/07/2023"
  },
  "day5": {
    "title": "not bad but i want more",
    "text": "اليوم لم استيقظ حتى العاشرة و بدأت العمل على الحادية عشر على عكس ما كنت أطمح لكنني أنهيت جزء جيدا من الموقع حيث ركزت على جزء responsive اليوم و قمت بعمل جيد لكنني أريد أكثر من هذا علي تخصيص ساعات أكثر من أجله و العمل بسرعة لأنني لاحظت بطئي الشديد أثناء العمل حيث أقضي أوقات طويلة في بعض الأحيان أفكر في حيرة حول شيء ليس بذالك الأهمية أو أن أحاول تطبيق شيء صعب لست متمكنا منه جيدا لكن على العموم يوم عادي و ساخن خصوصا هنا في اغير حيث يمكننا القول أن الصيف قد بدأ الآن ليس المفضل لدي حيث أحب الفصول الباردة و المعتدلة أكثر ربما الشيء الأجمل في هذا الفصل هو العطلة الصيفية التي تتيح لك متسعا من الوقت، أنوي استثمارها بشكل جيد جدا إنشاء الله",
    "image": "",
    "date": "11/07/2023"
  },
  "day6": {
    "title": "not the best but i keep going",
    "text": "لم أستيقظ مرة أخرى لصلاة الصبح بل استيقظت على السابعة شربت الحريرة تزامنا مع رحيل أبي و خاليد لأنه يو الأربعاء.عموما رجعت الى البيت العلوي و شغلت الحاسوب و بدأت العمل رغم شعوري الشديد بالنعاس فجأة انقطع التيار فنمت و لم استيقظ حتى التاسعة و النصف جربت المصباح لكن الكهرباء ما زال منقطعا نزلت الى المنزل السفلي و من شدة التعب نمت مرة أخرى في 'أسراك' بعد مدة استيقظت و فطرت و فوجئت أن سبب انقطاع الكهرباء كان انتهاء الرصيد و عادت الكهرباء مرة أخرى بعد إدخال أمي البطاقة للتجديد الرصيد، لو كنت أعلم لأدخلتها بدل النوم و انتظار رجوعها. عموما لم أعمل أي شيء في الفترة الصباحية جل ما أنزته في الكود كان بعد الزوال ليس ما كنت أطمح لإنجازه لكن على الأقل أفضل من لا شيء و أرجو أن يكون غدا أكثر انتاجية انشاء الله",
    "image": "",
    "date": "12/07/2023"
  },
  "day7": {
    "title": "It didn't start that good but it ends very good",
    "text": "اليوم لم استيقظ لصلاة الفجر مجددا هذا أغضبني حقا لأنني أستيقظ بعها بساعتين أي أنني نمت فقط كي لا أصلي عموما نهضت حوالي السابعة توضأت و صليت ثم نزلت و شربت الحريرة كالعادة بعدها نمت مجددا في 'أسراغ' نمت نموا أفضل من الذي نمته في الليل حيث كان الجو ساخنا جدا لم أستطع النوم على راحتي لكن هنا في 'أسراغ' كان الجو لطيفا ليس باردا و ليس ساخنا. عموما نهضت مرة أخرى وفطرت ببطئ ثم توجهت للعمل بدأت و في ذهني أن أكمل الجزء الخاص بالتنسيقات لأنتقل إلى جزء الجافاسكريبت أنجزت بعض العمل ثم ذهبت للغذاء بعها عدت لأكمل العمل و بقيت على هذه الحالة حتى آذان العصر نزلت و أكلت وجبة خفيفة لعبت الكرة قليلا ذهبت لأسلم أجزاء البلاغي للحوس لكنني لم أجده فعلقتها في مقبض الباب. صليت العصر أعلم أني تأخرت لكن الشيطان لا يفتئ يأخرني عنها بعدها تصفحت الفايسبوك قليلا حتى آذان المغرب صليت ثم عدت إلى المنزل العلوي كنت أنوي فقط مشاهدة بعض المحتوى الترفيهي لكنني بدأت بإكمال ما تبقى من الكود و أخيرا انتهيت على الساعة الواحدة و أربيعين دقيقة بعد منتصف الليل أشعر بتعب شديد و علي النوم خصوصا أنني ذاهب إلى أنزي غدا إنشاء الله. عموما يوم منتج و رائع من حيث الإنتاجية هذا هو المستوى الذي أطمح إليه و علي جعله المستوى الطبيعي للإنتاجية يوميا.",
    "image": "20230713_070951.jpg",
    "date": "13/07/2023"
  },
  "day8": {
    "title": "A day off but it's for good",
    "text": "اليوم ذهبنا إلى أنزي فاجئتني الحرارة الكبيرة جدا كنت أنوي قضاء يومين لكنني رجعت في نفس اليوم رفقة خاليد حيث كان هو الذي أقلنا في الصباح رفقة إبا التي أرسلناها في سيارة الأجرة الى تزنيت. عموما لم أنجز الكثير حيث جل ما فعلته هو انهاء جزء صغير خاص بالresponsive و بعدها قضيت باقي اليوم أنزل سلسلات tutorials حول css و JavaScript و front-end عموما نزلت كمية لا بأس بها مازال في ذهني المزيد من الأشياء و الكورسات أريد تنزيلها أتمنى أن أحدث قفزة كبيرة في مستواي هذا الصيف إنشاء الله.",
    "image": "20230714_070931.jpg",
    "date": "14/07/2023"
  },
  "day9": {
    "title": "I am late but still going",
    "text": "تأخرت كثيرا في الإستيقاظ حيث لم أستيقظ حتى الحادية عشر صباحا فطرت ثم أنجزت جزء صغيرا من الJavaScript ثم أكلنا الغداء اليوم يوم السبت و خاليد لا يعمل و تغدى معنا حيث أكلنا 'تاغارين' عموما رجعت بعها و بدأت العمل فعليا و تمكنت من اتمام جزء لا بأس به الجزء الخاص بmaster challenge لكن القادم أصعب لكنني أشعر بالحماس تجاه الأمور الجديدة التي سأتعلمها و أتعرف عليها رغم أنني ما زلت أعتقد أنني أستطيع بذل جهد أكبر و تخصيص وقت أكثر لها و ما يأرقني أكثر هو سلسلة الأيام التي لا زالت مستمرة التي لم استيقظ فيها لصلاة الصبح أعتقد أني تهاونت قليلا يجب أن آخد الأمور بجدية أكثر و أكسر هذه السلسلة غدا إنشاء الله",
    "image": "",
    "date": "15/07/2023"
  },
  "day10": {
    "title": "Marriage but not a good day",
    "text": "اليوم لم أنجز شيئا إنها الخامسة صباحا الآن و لازلت مستيقظا بسبب العرس الذي ما زالت مراسيمه مستمرة حيث نحن الآن بصدد 'تنغيفت' يجدر الذكر أن العرس أقيم بتافراوت ذهبنا إليها أنا و مصطفى و خاليد لست فخورا أو سعيدا بهذا اليوم لم أصلي سوى صلاتين فقط لهذا أكره المكوث في غير منزلك طويلا طبعا هناك مساجد في كل مكان لكن حتى الصحبة لا تساعدك على ذالك عموما كلها أعذار لا تعفني من هذا الخطء الكبير جدا أتمنى من الله أن يغفر لي و لكل المومينين و المومينات إنشاء الله.",
    "image": "20230716_215958.jpg",
    "date": "16/07/2023"
  },
  "day11": {
    "title": "Another day has gone",
    "text": "اليوم بعد العرس أمضيت جله في النوم حيث نمت على الساعة الثامنة و لم أستيقظ حتى الرابعة بعد الظهر لم يكن نوما جميلا خصوصا أنني نمت في تيغمي مقر عمل خاليد بسبب ضيق الوقت حيث لم يكن هناك وقت للعودة إلى إغير لأن خاليد يبدأ العمل من الثامنة صباحا لذالك قدمنا من أيت بها مباشرة إلى تغمي. عموما ضيعت يوما آخر في النعاس و الآن بعد عودتي إلى إغير علي الدخول في طور الإنتاجية مجددا ابتداء من الغد إنشاء الله",
    "image": "",
    "date": "17/07/2023"
  },
  "day12": {
    "title": "not the top but it's a comeback",
    "text": "تستمر السلسلة و لا أستيقظ مجددا لصلاة الصبح بعد يومان منعدمي الإنتاجية يأتي اليوم متوسط إلى جيد حيث أنجزت جزء مهما من مرحلة الJavaScript و لم يبقى الكثير حتى يكتمل المشروع و أرى هذه التدوينة على الموقع عوض google notes لكن بدأت أشعر أنني قضيت الكثير من الوقت على هذا المشروع ربما أكثر من الازم يجب أن أنهيه في حدود يوم أو يومين على الأكثر لأن هناك الكثير من الأشياء الأخرى التي أريد العمل عليها.الجدير بالذكر أنني ربما أصبت بزكام لا أشعر بأنها سيئة الآن لكن ربما تتطور غدا و ستبطء تقدمي لكن قدر الله ما شاء فعل نتمنى الشفاء بإذن الله لا شفاء إلا شفائه تعالى.",
    "image": "",
    "date": "18/07/2023"
  },
  "day13": {
    "title": "A day off",
    "text": "اليوم كما توقعت نهظت بحالة سيئة حيث تملكني الدوار و لا أستطيع حتى المشي بطريقة جيدة أو سريعة لكن هذا لم يكن الأسوء حيث شربت القليل من الحساء لم يلبث كثيرا في معدتي حيث أصبت بالغثيان مرتين لكن بعد أكل القليل من الأرز و شرب دواء 'الفنيز أو كايو' بعدها بلحظات شعرت بتحسن لكن مع اقتراب العشاء بدأت بعض الأعراض تعود مرة أخرى فأكلت الأرز مجددا و شربت نفس الدواء و ها أنا الآن أستعد للنوم أدعو الله أن يشفيني و يشفي سائر المسلمين و المسلمات بقدرته إنشاء الله",
    "image": "IMG-20230724-WA0002.jpg",
    "date": "19/07/2023"
  },
  "day14": {
    "title": "Another day off",
    "text": "ما زلت الييوم مريضا ربما أسوء من البارحة لا يوجد الكثير لأقوله غير أنني قضيت اليوم مجددا في الإستلقاء الحمد لله على كل حال اشفني أنت الشافي لا شفاء إلا شفائك",
    "image": "",
    "date": "20/07/2023"
  },
  "day15": {
    "title": "Its the Third day off but i am good",
    "text": "اليوم الثالث من أيام المرض لم أنم الليل مجددا و نهظت فور بزوغ الشمس شربت الحريرة و جلست قليلا أتأمل حالتي حينها ما زالت حالتي سيئة و ما زلت أشعر بالدوار و ألم في الأطراف لكن و لله الحمد بعد تناول الغذاء رغم أني لم أكل سوى القليل شعرت ببعض التحسن حتى أنني خرجت مع مصطفى و الحسان بعد الظهر و جلسنا تحت شجرة مع لعربي بن براهيم . عموما بدأت أشعر بتحسن كبير في حالتي و أنني قد تخطيت المرض بفضل الله لقد كلفني الكثير من الوقت ثلاثة أيام بدون عمل لكن قدر الله ما شاء فعل إنشاء الله سوف أعود للعمل غدا و بقوة أكثر بإذن الله تعالى",
    "image": "",
    "date": "21/07/2023"
  },
  "day16": {
    "title": "Not the best but a goid comeback",
    "text": "اليوم نمت جيدا الحمد لله و استيقظت رغم أني تقريبا شفيت من المرض إلا أن بعض الآثار لا زالت باقية حيث كنت متعبا جدا لهذا لم أنجز الكثير لكن على الأقل أتممت بعض المهام على أمل انجاز شيء أكثر غدا رغم أنني تأخرت جدا في النوم و لن أستطيع الإستيقاظ باكرا لكنني عازم في كل الأحوال على انجاز جزء جيد من العمل غدا لأنني تواق لإنهاء هذا المشروع الذي طال كثيرا حيث كنت أنوي انهائه بحلول اليوم لكن المرض حال دون حدوث ذالك قدر الله ما شاء فعل ليست مشكلة كبيرة و أنا واثق انشاء الله من قدرتي على انهائه في الوقت",
    "image": "",
    "date": "22/07/2023"
  },
  "day17": {
    "title": "Bad news",
    "text": "اليوم نمت حتى وقت متأخر و استيقظت غافلا عن ما يجري إذ بي أتفاجئ أن الجميع ذهب إلى أكادير لأن خالي الحاج العربي مات رحمه الله تفاجئت كثيرا و جلست فترة لأستوعب الأمر فعلا لا يمكن توقع أي شيء بخصوص هذه الحياة تأتي الأشياء دائما على غفلة. عموما أتت عمتي من أنزي لتغطي غياب أمي التي ذهبت هي أيضا إلى أكادير . أما بخصوص العمل فقد أنجزت جزء بسيطا لكنني لا زلت غير راضي عن مستوى عملي خصوصا أنني لم أعمل في الصباح و خسرت هذا الكم من الساعات الثمينة لكن الجدير بالذكر أنني على وشك الإنتهاء من المشروع لم يبقى سوى القليل الحمد لله",
    "image": "",
    "date": "23/07/2023"
  },
  "day18": {
    "title": "It took soo long but finally it ends",
    "text": "اليوم مازلت عند تخاذلي و لم أستطع الإستيقاظ باكرا مجددا علي حقا وضع حد لهذه السلسلة الجدير بالذكر أنني قضيت وقت لا بأس به في مشاهدة أعمال الطريق التي كانت اليوم بالقرب من المنزل عدت بعدها إلى المنزل العلوي و بدأت العمل تقريبا على الساعة 3:40 نعم وقت متأخر جدا و تمكنت أخيرا بعد عناء و الكثير من العقبات من إنهاء مشروعي بقي فقط ادخال بعض الداتا و أنا تقريبا أنهيت هذا أيضا أنا الآن متحمس للمستقبل و إلى أين يمكن أن أصل لكنني ما زلت أصر على أن السبيل لتحقيق أكبر استفادة من هذه العطلة الصيفية هي بالعمل لأكبر عدد من الساعات في اليوم و سأحوال هذا إنشاء الله",
    "image": "",
    "date": "24/07/2023"
  },
  "day19": {
    "title": "A new area but still not clear",
    "text": "اليوم أول يوم بعد الإنتهاء من المشروع لم يكن كما توقعته واجهت بعض العقبات و التأخيرات التي أددت بي إلى العمل لفترة صغيرة فقط مثل أعمال الطريق التي كنت أراقبها و أتفقدها مرارا و تكرارا و كذالك قناة التلفاز الجديدة التي تجذبني و تضيع جزء كبيرا من وقتي رغم أنني لست في فترة الترفيه لكن مصطفى يشاهد التلفاز يوميا لذالك القناة تنجح بجذبي و تضييع وقت ثمين مني عموما أنوي استغلال و استثمار وقت أكثر في هذا الشغل لزيادة أكبر قدر ممكن من المعلومات و الفائدة إنشاء الله",
    "image": "",
    "date": "25/07/2023"
  },
  "day20": {
    "title": "Still the same",
    "text": "اليوم يمكن القول أنه نسخة من الأمس غير أننا لم نخرج اليوم إلى 'دو إغرم' لكن عموما بدأت اليوم متأخرا مجددا و أمضيت الكثير من الوقت في مراقبة أشغال الطريق و كذالك القناة الجديدة التي حتى إن لم أشاهدها تأخد مني الكثير من الوقت كل هذا مع تهاوني الذي زاد مؤخرا بشكل كبير حيث أسهر على مشاهدة القناة و لا أستيقظ لصلاة الصبح لا أذكر حتى آخر مرة نهظت لصلاة الصبح منذ و قت طويل جدا على الأرجح هذا ليس ما أطمح له العطلة الصيفية انتصفت تقريبا لم يبق الكثير على نهاية هذا الكم الكبير من أوقات الفراغ اليومية و سيكون علي العودة للدراسة مجددا آمل أن أستغل هذه الأوقات بشكل جيد إنشاء الله",
    "image": "",
    "date": "26/07/2023"
  }
  
}
}

